## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/7355317843)



<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.security_dashboard_token.google_cloud_run_service.security_dashboard_token
  * module.security_dashboard_token.google_cloud_run_service_iam_policy.noauth
* Update
  * module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner



<details><summary>Change Result (Click me)</summary>

```hcl

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact_registry" {
        id               = "projects/kyma-project/locations/europe/repositories/modules-internal"
        name             = "modules-internal"
        # (11 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.security_dashboard_token.google_cloud_run_service.security_dashboard_token will be created
  + resource "google_cloud_run_service" "security_dashboard_token" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west1"
      + name                       = "security-dashboard-token"
      + project                    = "sap-kyma-prow"
      + status                     = (known after apply)

      + metadata {
          + annotations           = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + effective_annotations = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + effective_labels      = (known after apply)
          + generation            = 0
          + namespace             = (known after apply)
          + resource_version      = (known after apply)
          + self_link             = (known after apply)
          + terraform_labels      = (known after apply)
          + uid                   = (known after apply)
        }

      + template {
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev/kyma-neighbors-dev-test/security-dashboard-token:0.0.2"
                  + name  = (known after apply)

                  + env {
                      + name = "CLIENT_ID"

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "security-dashboard-oauth-client-id"
                            }
                        }
                    }
                  + env {
                      + name = "CLIENT_SECRET"

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "security-dashboard-oauth-client-secret"
                            }
                        }
                    }
                }
            }
        }
    }

  # module.security_dashboard_token.google_cloud_run_service_iam_policy.noauth will be created
  + resource "google_cloud_run_service_iam_policy" "noauth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "sap-kyma-prow"
      + service     = "security-dashboard-token"
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ artifact_registry                                   = {
      ~ modules-internal = {
          ~ artifact_registry_collection = {
                id                        = "projects/kyma-project/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
              ~ update_time               = "2023-12-29T09:01:56.418428Z" -> "2023-12-29T09:05:41.879513Z"
                # (16 unchanged attributes hidden)
            }
        }
    }
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":9595,"Program":"tfcmt","SHA1":"8907e8a649859069426e0703be9eae3abed71320","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->